_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_1 (Conv2D)            (None, 124, 124, 6)       156       
_________________________________________________________________
activation_1 (Activation)    (None, 124, 124, 6)       0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 41, 41, 6)         0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 37, 37, 16)        2416      
_________________________________________________________________
activation_2 (Activation)    (None, 37, 37, 16)        0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 12, 12, 16)        0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 2304)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               1180160   
_________________________________________________________________
activation_3 (Activation)    (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               131328    
_________________________________________________________________
activation_4 (Activation)    (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 43)                11051     
_________________________________________________________________
activation_5 (Activation)    (None, 43)                0         
=================================================================
Total params: 1,325,111
Trainable params: 1,325,111
Non-trainable params: 0
_________________________________________________________________
